{
    "basic_info": {
        "title": "Predicting the popularity of scientific publications by an age-based diffusion model",
        "authors": [
            "Yanbo Zhou",
            "Qu Li",
            "Xuhua Yang",
            "Hongbing cheng"
        ],
        "paper_id": "2010.08157v1",
        "published_year": 2020,
        "references": []
    },
    "raw_chunks": [
        {
            "text": "3. Results\n\nThe popularity prediction problem we studied in this paper is to identify which paper can receive more citations in the near future and will be popular. We use the APS data set introduced in section 2.1 to test\n\n4\n\nthe performance of diﬀerent prediction methods. While evaluating the prediction performance of diﬀerent prediction methods, the citation data before the testing time t is used as training set to calculate the prediction score, and the citation date in a future time window Tf just after the time t is used as test set to evaluate the performance. For a given time t, the citation increase of paper i in future Tf time window is\n\nfi(t) = ∆ci(t,Tf) = ci(t + Tf) − ci(t), (9)\n\nwhere ci(t) is the number of citations paper i receives until time t. The quantity fi(t) can measure the temporal interest in paper i, and can be considered as the real future popularity of paper i after time t. The age of paper i is calculated by the diﬀerence between the publication date of the paper and the testing time t.\n\nAs all the prediction methods we considered in this paper are based on papers’ citation, we removed the papers that have not get any citations before the testing time t from the training set and test set.\n\n3.1. Evaluation metrics\n\nThe prediction score calculated based on the training set could be compared with the real future popular- ity calculated based the test set to evaluate the performance of a prediction method. For a given paper i, we use si to denote its prediction score and fi to denote its real future popularity. We introduced three metrics to evaluate the prediction performance of diﬀerent methods in this paper: Pearson correlation coeﬃcient, Spearman rank correlation coeﬃcient and precision.\n\nPearson correlation coeﬃcient is a good way to quantify the similarity between two lists. The Pearson correlation coeﬃcient between the prediction score and the real future popularity of papers is given by\n\n1 si-8\\(fi-f wD (SS) (PF): ao\n\nwhere σs and σf are, respectively, the standard deviations of the prediction score and the real future popularity of papers, and ¯s and ¯f are their expected values. The values of Pearson correlation coeﬃcient are in the range [−1,1]. A higher value indicates a higher correlation between two lists.\n\nWhile evaluating the performance of a prediction method, the prediction score can be mapped into a predicted ranking, and then we could compare the predicted ranking with the real ranking. Spearman rank correlation coeﬃcient is simply a special case of the Pearson correlation coeﬃcient in which two sets of data are converted to rankings before calculating the coeﬃcient. We use rsi to denote the ranking of the paper i ranked by prediction score and rfi to denote the ranking of the paper i ranked by real future popularity. If there are equal values in the ranked list, they will be assigned the same ranking using the average of their positions. The Spearman rank correlation coeﬃcient is calculated by\n\n1 Ts, —Ts ry, — TF = - 11 p N ( or, ) ( or; ). ( )\n\nwhere σrs and σrf are, respectively, the standard deviations of the rankings by prediction score and the real future popularity of papers, and ¯rs and ¯rf are their expected values.\n\nInstead of predicting the popularity of all papers, it is more important to predict which paper will be popular in the future. So when evaluating the performance of a prediction method, we can only consider the top part of the ranking list. Precision is a metric based on this. Precision calculates the proportion of papers that are ranked in the top n positions by prediction score are really top n papers ranked by real future popularity. The precision of a prediction method is deﬁned as Pn = Dn/n , where Dn indicates the number of common papers in the top n positions of the predicted ranking and the real ranking. It ranges from 0 to 1, the higher the better. In this paper, we restricted our analysis to top 1% papers in the test set.",
            "section": "results",
            "section_idx": 0,
            "citations": []
        },
        {
            "text": "3.2. The eﬀectiveness of the AD model\n\nTo evaluate the performance of the AD model with diﬀerent parameters τ and α, we selected the testing time as the beginning of the year 2010 and the future time window Tf as 5 years. In this case, We used\n\n5\n\nthe data before 2010 to predict the popularity of papers, and used the data in a future time window of 5 years to test the performance. Figure 1 shows the result. From ﬁgure 1, we could ﬁnd that, for a given α, a suitable decay parameter τ can signiﬁcantly increase the prediction performance. This indicates that papers’ temporal information plays an important role in predicting papers’ popularity. The best performance of AD model can be achieved by a suitable value of τ and α. The highest precision is achieved when α = 0.74 and t = 24, the highest Spearman rank correlation coeﬃcient is achieved when α = 0.49 and t = 54, and the highest Pearson correlation coeﬃcient is achieved when α = 0.54 and t = 18. As the three evaluation metrics focus on diﬀerent aspects, there is an appreciable discrepancy in the best parameters of the three evaluation metrics.\n\nA\n\nA\n\n120 0.64 0.63 0.62 100 0.61 0.60 0.59 80 0.58 0.57 60 0.56 0.55 0.54 40 0.53 0.52 0.51 20 0.50 0.49 B 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 120 0.72 0.71 100 0.70 80 0.69 60 0.68 40 0.67 20 0.66 C 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 120 0.87 0.86 0.85 100 0.84 0.83 0.82 80 0.81 0.80 60 0.79 0.78 0.77 40 0.76 0.75 0.74 20 0.73 0.72 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9\n\nFigure 1: The performance of the AD model with diﬀerent parameters τ and α. (A) Precision. (B) The Spearman rank correlation coeﬃcient. (C) The Pearson correlation coeﬃcient. The testing time is set as the beginning of the year 2010, and the future time window Tf is 5 years.\n\nWhile evaluating the performance of a prediction method, a small future time window Tf represents a\n\n6\n\nshort term popularity, and a large Tf represents a long term popularity. Therefore, we tested the performance of diﬀerent prediction methods under diﬀerent Tf to compare their performance. To eliminate the inﬂuence that may be caused by diﬀerent testing time, we obtained the ﬁnal results by averaging the results of ﬁve randomly selected testing time t. To make sure that there is enough data in both the training set and the test set, the ﬁve randomly selected testing time t is select in the range from January 1990 to January 2006. The parameters for CiteRank and the AD model are selected as the one corresponding to the highest value of the target metric. Figure 2 shows the prediction performance of diﬀerent prediction method as a function of the future time window Tf.\n\n0.6 n o i s i c e 0.4 r P 0.2 1 2 3 4 5 6 7 8 9 10 0.8 0.6 PR CR AD RS 0.4 0.2 1 2 3 4 5 6 7 8 9 10 0.8 0.7 r 0.6 0.5 0.4 0.3 1 2 3 4 5 6 7 8 9 10",
            "section": "results",
            "section_idx": 1,
            "citations": []
        },
        {
            "text": "age (year)\n\nFigure 4: The cumulative distribution of the age of the top 1% papers ranked by diﬀerent methods. The results of CiteRank (CR), PageRank (PR), rescaled PageRank (RS), and the age-based diﬀusion (AD) model are shown respectively. The real top 1% papers that ranked by the data in the future time window are also shown for comparison.\n\n4 PR RS 3 AD CR 2 1 r 0 -1 -2 -3 0 10 20 30 40 50 60 70 80 90\n\nage (year)\n\nFigure 5: The average value of ∆r for the papers under diﬀerent age. The results of CiteRank (CR), PageRank (PR), rescaled PageRank (RS), and the age-based diﬀusion (AD) model are shown respectively. Only the top 1% papers in the future time window are considered to show the ranking diﬀerence of the top papers with diﬀerent age.\n\n9\n\nmethods have an obvious bias for papers with diﬀerent age. Newly published papers are underestimated and very old papers are overrated. While the AD model has no obvious bias for papers with diﬀerent age, and the average ∆r value is close to zero for all ages. This indicates that the AD model has a good prediction performance for both old and new papers.\n\nAD CR RS PR 0.8 e t a r n o i t c e t e 0.4 D 0.0 30 60 age (year)\n\nFigure 6: The correlation of detection rate with age under diﬀerent prediction methods. The results of CiteRank (CR), PageRank (PR), rescaled PageRank (RS), and the age-based diﬀusion (AD) model are shown respectively.\n\nA prediction method may have diﬀerent precisions for papers with diﬀerent ages. We separated the real top 1% papers in bins by age of every 5 years. The detection rate of each bin is deﬁned as the rate of papers that can be detected as top 1% papers by a prediction method. We plotted ﬁgure 6 to show the correlation of detection rate with age under diﬀerent prediction methods. It is obviously that, PageRank can only detect very old papers as top papers, and the detection rate of newly published papers is nearly zero. The rescaled PageRank can factor out the bias that caused by age in PageRank, and the detection rate of newly published papers is obviously higher than the result of PageRank. CiteRank can further improve the detection rate of newly published papers, while keeping a relatively high detection rate of old papers. Compared with CiteRank, the AD model highly increases the detection rate of the latest papers that less than 10 years old but decreases the detection rate of papers that older than 30 years. We have found in ﬁgure 4 that the number of papers ranked in the real top 1% is decay rapidly with age, and most of the top papers are newly published papers. So the detection rate of newly published papers is more important than the detection rate of old papers, and a small increase in the detection rate of newly published papers may result in a big improvement of the total prediction precision. The result is that the AD model has the highest overall precision.\n\nFrom the experimental result, we could ﬁnd that, AD model has a good ability to predict which newly published papers will be popular in the near future while keeping a relatively high overall prediction precision.",
            "section": "results",
            "section_idx": 2,
            "citations": []
        },
        {
            "text": "4. Conclusion and Discussion\n\nThe age-based diﬀusion (AD) model we propose in this paper is a model simulating the attention diﬀusion process along the citation networks. Researchers typically start “surﬁng” scientiﬁc publications from a rather recent publication that catch their attention, and then they will follow the paper’s references with the probability that is exponentially decaying with the paper’s age and also decays with the iteration of steps. The AD model is a time-aware method, and we use it to predict the future popularity of scientiﬁc papers. We introduced three metrics to evaluate the performance in citation prediction: Pearson correlation coeﬃcient, Spearman rank correlation coeﬃcient and precision. The experimental results show that the AD model can improve the prediction accuracy compared with other benchmark methods. For some newly published papers that have not accumulated many citations but will be popular in the near future, the AD model can substantially improve their rankings. This is critical, because identifying the future highly\n\n10\n\ncited paper from thousands of new papers published each month would provide very valuable references for researchers.\n\nWhile predicting the future popularity of scientiﬁc papers using citation networks, we have to face the ”cold start” problem. This problem refers to the case in which newly published papers have zero or few citations. Time-aware methods may increase the possibility to detect the potential popular papers that are newly published. But essentially, implementing time-aware methods still need citation information, and such kind of methods have inherent limitations to predict the popularity of newly published papers that have zero or few citations. Exploiting paper metadata is one way to solve the “cold start” problem. Although metadata based prediction methods do not seem to have signiﬁcant advantage in popularity prediction of papers[26], combining network based prediction methods with metadata based methods may eventually solve the “cold start” problem and have a much higher overall predict precision. This will be the direction of our future works on popularity prediction of scientiﬁc papers.",
            "section": "results",
            "section_idx": 3,
            "citations": [
                "26"
            ]
        },
        {
            "text": "2020:\n\n0\n\n2\n\n0\n\n2\n\nt c O 6 1 ] L D . s c [ 1 v 7 5 1 8 0 . 0 1 0 2\n\n:\n\nv\n\ni\n\nX\n\nr\n\na\n\nPredicting the popularity of scientiﬁc publications by an age-based diﬀusion model\n\nYanbo Zhou, Qu Li, Xuhua Yang, Hongbing cheng\n\nCollege of Computer Science and Technology, Zhejiang University of Technology, Hangzhou, P. R. China\n\nAbstract\n\nPredicting the popularity of scientiﬁc publications has attracted many attentions from various disciplines. In this paper, we focus on the popularity prediction problem of scientiﬁc papers, and propose an age-based diﬀusion (AD) model to identify which paper will receive more citations in the near future and will be popular. The AD model is a mimic of the attention diﬀusion process along the citation networks. The experimental study shows that the AD model can achieve better prediction accuracy than other network- based methods. For some newly published papers that have not accumulated many citations but will be popular in the near future, the AD model can substantially improve their rankings. This is really critical, because identifying the future highly cited papers from massive numbers of new papers published each month would provide very valuable references for researchers.\n\nKeywords:\n\nPopularity prediction, Citation network, Diﬀusion process\n\n1. Introduction\n\nWith the increase of researches and the pressures that drive scholars to continuously produce publishable results[1], the volume of scientiﬁc literatures is growing exponentially[2]. That brings out the information overload problem, and it’s hard to retrieve and evaluate scientiﬁc literatures eﬀectively. Measuring the scientiﬁc inﬂuence of scientiﬁc publications has been one of the focuses of scietometrics[3]. Citation count and its variations are widely used to evaluate the inﬂuence of scientists and scientiﬁc publications[4, 5], such as total citation count for papers and scientists, H-index[6] for scientists, and impact factor[7] for journals. The purpose of most of these metrics is to evaluate the historical inﬂuence of publications or scientists. Predicting the popularity of scientiﬁc publications and prestige of scientists is still a challenging issue which has attracted much attention from various disciplines. It can help researchers to ﬁnd potential popular research directions, and can provide very valuable references for institutions to decide who they should hire or which project they should fund.\n\nAs the citation relationship of papers can be expressed as a directed network, many network-based models are used to evaluate the inﬂuence of scientiﬁc papers. According to preferential attachment theory, the future inﬂuence of papers is in proportion to the historical inﬂuence[8]. The linear extrapolation method based on preferential attachment mechanism has a strong bias to the old papers which have accumulated many citations, and it’s hard to predict the future inﬂuence of newly published papers which have not yet get many citations. By using z-score to factor out the bias that caused by aging in preferential attachment[9], some newly published papers that have not yet received many citations but will receive much attentions in the future can be detected[10]. Similar approach can be introduced to other methods that have an obvious bias by age[11] or ﬁelds[12]. In a network, the intrinsic ﬁtness theory assumed that the probability of a\n\n∗Corresponding author\n\nURL: liqu@zjut.edu.cn (Qu Li)\n\nPreprint submitted to JOI\n\nOctober 19, 2020\n\nnode to attract new links is proportional to its intrinsic ﬁtness value[13, 14]. Citation networks are temporal networks, and the ﬁtness values of papers decay exponentially with time[15]. Considering the temporal decay eﬀect, using a weighted citation count to predict the future popularity of papers can improve the prediction accuracy[16], and this method performs well in predicting the future popularity of newly published papers. A thorough study of the life-cycle of papers suggests that the citation rate of a paper increases in a few years after its publication, reaches a peak and then decreases rapidly[17]. Considering the preferential attachment, ﬁtness, and aging eﬀects, the future citations of a paper can be predicted through establishing optimal ﬁtting parameters[18].\n\nCitation count based methods only use local information of citation networks to predict the popularity of papers. However, in real citation networks, nodes are heterogenous[19]. The structures of citation networks should be analyzed to evaluate the inﬂuence of papers. PageRank is a process of random walk on a directed network, and it was initially introduced to measure the importance of web pages ([20, 21]). Citation network has common features with WWW, since they are both directed network and every incoming link corresponds to a positive rating. So Pagerank can naturally be used to citation networks to rank scientiﬁc papers[22, 23]. However, Pagerank dose not consider the aging eﬀects in bibliometrics[15, 17]. CiteRank[24] (CR) is a more practical model for the diﬀusion along the citation network. It is an adaptation of the PageRank algorithm to citation networks, and it gives more weight to recent publications while starting a random work. The node scores of CiteRank can be used to predict the future popularity of papers. There are some other variants of PageRank that infuse time-awareness to evaluate the inﬂuence of papers[26]. In the time-aware methods, the importance of a citation depends not only on the importance of the citing paper, but also on the temporal features of citations.\n\nIn this paper, we focus on the popularity prediction problem of scientiﬁc papers, and propose an age- based diﬀusion (AD) model to predict the future popularity of scientiﬁc papers. The AD model considers the aging eﬀects in bibliometrics, and employs a process analogous to random walk across citation networks. While distributing a paper’s score to its references, an exponential decay mechanism is introduced and the probability of distributing a paper’s score to its references decays with the iteration of steps. The experimental results show that the AD model can identify the future popular papers in their early life and improve the overall citation prediction accuracy. The rest of this paper is organized as follows: In Section 2 we introduce the data set we used, brieﬂy review some benchmark methods and introduce the age-based diﬀusion (AD) model. In Section 3 we systematically evaluate the eﬀectiveness of the proposed model in predicting citations of papers. Finally, we conclude the paper in section 4.",
            "section": "other",
            "section_idx": 0,
            "citations": [
                "1",
                "2",
                "3",
                "4, 5",
                "6",
                "7",
                "8",
                "9",
                "10",
                "11",
                "12",
                "13, 14",
                "15",
                "16",
                "17",
                "18",
                "19",
                "20, 21",
                "22, 23",
                "15, 17",
                "24",
                "26"
            ]
        },
        {
            "text": "2. Material and methods\n\n2.1. Data Description\n\nWe use the bibliographic data set provided by the American Physical Society (APS)1 for analysis in this paper. The data set contains article metadata and citing article pairs of the corpus of Physical Review Letters, Physical Review, and Reviews of Modern Physics from 1893 through 2017. We pre-processed the date and removed the papers with incomplete information. And ﬁnally, there are 616316 papers with 7336550 citations among them. In the original data set, the publication date of each paper is recorded in the resolution of day. In this paper, we use time resolution of month to record papers’ publication date. And for each paper, we used its publication month as its publication date. The citation relationship of papers can be expressed by a directed network. If paper i cites paper j, there will be a link from paper i to paper j in the directed network.\n\n2.2. Related Metrics\n\nIn this subsection, we will introduce three related network based methods that can be used to predict the popularity of scientiﬁc papers.\n\n1http://journals.aps.org/datasets\n\n2\n\n2.2.1. PageRank\n\nPageRank (PR) is a process of random walk on a directed network, and can naturally be used to citation network to rank scientiﬁc papers. PageRank deﬁnes the ranking score of each node in a directed network, and the ranking score of node i, si, should satisfy:\n\nsi = c N j=1 Aji kout j (1 − δkout j ,0) + 1 N δkout j ,0 ! sj + 1 − c N . (1)\n\nX\n\nand ksk = 1. In equation 1, δa,b = 1 when a = b and δa,b = 0 otherwise, N is the total number of nodes in the network, kout j is the out degree of node j, and A is the adjacency matrix of the network. The PageRank algorithm simulates the behaviour of “random surﬁng” in the internet. While surﬁng randomly in the internet, people start their surﬁng by visiting a web page, and then they either follow one of the page’s hyperlink to visit another web page or choose any other web pages in the internet randomly. The PageRank score captures the frequency of a particular web page to be visited by a random surfer, and the PageRank score of a node is divided among its forward links evenly to contribute to the PageRank scores of the nodes it point to. PageRank score can be computed by starting with any set of initial score and iterating the computation until it converges. c is a damping factor controls the probability to follow a hyperlink while surﬁng. It can be set between 0 and 1. In case of citation networks, the value of c is usually set to 0.5[22, 23]. Accordingly, we use c = 0.5 in our study.",
            "section": "other",
            "section_idx": 1,
            "citations": [
                "22, 23"
            ]
        },
        {
            "text": "2.2.2. CiteRank\n\nIn PageRank, it assumes that a web surfer starts his/her surﬁng from a randomly selected web page. But it is unreasonable for the citation networks. There are aging eﬀects in bibliometrics which can not be ignored. Researchers typically start “surﬁng” scientiﬁc publications from a rather recent publication which caughts their attention. CiteRank[24] (CR) is a more practical model for the diﬀusion along the citation networks. It is an adaptation of PageRank algorithm to citation networks. The CiteRank score represents the recent popularity of a scientiﬁc paper and can be used to predict the popularity of the paper. assumes that researchers preferentially start from a rather recent paper and progressively follow the paper’s references with every step while “surﬁng” the citation network. The traﬃc of each paper that is calculated by CiteRank algorithm is ultimately used to predict the paper’s popularity. CiteRank deﬁnes transfer matrix W associated with the citation network as: It\n\n1\n\nwij = ( kout j 0, , if j cites i otherwise , (2)\n\nwhere kout j is the out-degree of the paper j. The probability of initially selecting the paper i to start a random work is:\n\nρi = e −agei/τ, (3)\n\nwhere τ is the decay parameter and agei is the age of paper i. Using ~ρ to express the vector of probability deﬁned by Eq.3, and the probability of encountering each paper after following one link can be calculated with αW~ρ. The CiteRank score of each paper is then deﬁned as the probability of encountering it via paths of any length:\n\n~S = ~ρ + αW~ρ + α2W 2~ρ + α3W 3~ρ + ···. (4)\n\nα is the probability that a researcher will follow a reference to an adjacent paper. CiteRank score is calculated by taking successive terms in above expansion to suﬃcient convergence.\n\n2.2.3. Rescaled PageRank\n\nPageRank has a strong bias towards the old papers which have accumulated many citations, so it is hard to predict the future inﬂuence of newly published papers which have not get many citations. The rescaled PageRank[11] (RS) uses z-score to factor out the bias caused by age in PageRank. The rescaled PageRank\n\n3\n\nscore of a paper i is calculated by the z-score of PageRank score for a group of papers published in a similar time as i:\n\nsi = pi − µi σi , (5)\n\nwhere µi and σi are respectively the mean and standard deviation of the PageRank score of the group, and pi is the PageRank score of the paper i. Ordering papers by age, the group of papers used to calculate the rescaled PageRank score of paper i are the papers j ∈ [i − ∆p/2,i + ∆p/2]. The parameter ∆p represents the number of papers in the average window of each paper. ∆p is set as 1000 in this paper. The rescaled PageRank score larger than zero indicates the paper out-performs other papers of similar age.",
            "section": "other",
            "section_idx": 2,
            "citations": [
                "24",
                "11"
            ]
        },
        {
            "text": "2.3. Age-based diﬀusion model\n\nBoth PageRank and CiteRank models are based on diﬀusive random walk. They do not exactly agree with the real process on citation networks. First, they only select one node to follow at each diﬀusion step, while researchers may select several references of a paper to follow. Second, they do not take into account the correlation between steps, however the probability that a researcher will follow a paper’s references is decay with the increase of steps. So, in this paper, we propose an age-based diﬀusion (AD) model which employs a process that analogous to random walk across the citation networks. The probability of initially selecting the paper i to start a random work is exponentially decay with the paper’s age, which is the same with CiteRank model deﬁned in equation (3). Considering the aging eﬀects in bibliometrics, we introduce an exponential decay mechanism while distributing a paper’s ranking score to its references. dividing among a paper’s forward links evenly to contribute to the ranking scores of its references, a paper’s ranking score is directly distributed to its references in the AD model. So the transfer matrix W of the AD model is deﬁned as: Instead of\n\ne−agej/τ,\n\nwij = 0, if j cites i otherwise , (6)\n\nwhere τ is the same decay parameter used in equation (3) and agej is the age of paper j. The ranking score vector of the papers is then deﬁned as:\n\n2 3 ~S = ~ρ + α1W~ρ + ( αi)W 2 ~ρ + ( αi)W 3 ~ρ + ···. i=1 i=1 (7)\n\nY\n\nY\n\nwhere ~ρ is the vector of probability that deﬁned by equation (3) and αi is the probability that a researcher will follow the references to adjacent papers at the ith step. This probability that a researcher will follow a paper’s references should decay with steps, because a researcher will be distracted rapidly while following paper’s reference step by step. So αi is set as a decreasing sequence:\n\nαi = α/10i−1. (8)\n\nα is the probability that a researcher will follow a reference to an adjacent paper at the ﬁrst setp. The ranking score of each paper can be get by equation (7) with enough terms to convergence.\n\nIn the AD model, the ratio of the ranking score that a paper will distribute to all its references expo- nentially decays with the paper’s age, which is consistent with the real condition that the probability to follow an old paper’s reference is small. And the probability to follow references decays with the increase of steps, which is consistent with the real condition that a researcher will be distracted rapidly while following paper’s references step by step. By introducing this two mechanisms, the AD model we propose in this paper can better simulate the attention diﬀusion process in citation networks.",
            "section": "other",
            "section_idx": 3,
            "citations": []
        },
        {
            "text": "T\n\n(year)\n\nf\n\nFigure 2: The prediction performance PageRank (PR), CiteRank (CR), rescaled PageRank(RS) and age-based diﬀusion (AD) model under diﬀerent Tf. The results are obtained by averaging the results of 5 randomly select testing time t.\n\nFrom ﬁgure 2, it is clear that the AD model outperforms other methods on all the three evaluation metrics for all Tf value. The performance of PageRank is signiﬁcantly worse than other methods. As PageRank model dose not take any temporal information while calculating the result, the prediction performance of PageRank may be limited. For CiteRank, rescaled PageRank, and the AD models, the precision and the\n\n7\n\nPearson correlation coeﬃcient have a small decrease with the increase of Tf. This indicates that it becomes more diﬃcult to predict a longer term popularity which may be inﬂuenced by more unexpected factors. But the Spearman rank correlation coeﬃcient increases with Tf. The reason may be that too many papers have the same real popularity value but diﬀerent prediction score when Tf is small, which can decrease the Spearman rank correlation coeﬃcient while comparing the diﬀerence between the two ranking list.\n\n10 10 10 10 10 10 3 3 3 R C 10 R P 10 S 10 R 2 2 2 10 10 10 1 1 1 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 10 AD AD AD 10\n\nFigure 3: The comparison of ranking results of the real top 1% papers. The x-axis is the ranking obtained by age-based diﬀusion (AD) model, and the y-axis is the ranking obtained by CiteRank (CR), PageRank (PR) and rescaled PageRank (RS) respectively. Black solid lines in all ﬁgures are y = x, indicating that the dot on it has the same rankings in the two methods.\n\n3.3. Top Papers Analysis\n\nIn reality, people is more conscious of the papers that will be popular in the future rather than the real future popularity of all papers. So, we analyzed the ranking results of diﬀerent methods for the papers that are ranked as top 1% papers. We selected the testing time as the beginning of the year 2010 and the future time window Tf as 5 years in this subsection to analysis the results. The parameters for CiteRank and the AD model are selected as the one corresponding to the highest value of precision.\n\nFigure 3 shows the ranking results of CiteRank, PageRank and rescaled PageRank methods compared with the ranking result of the AD model for the papers that are ranked as top 1% papers by real future popularity. Black solid lines are y = x. If a dot is positioned up the solid lines, it means that the paper represented by the dot is ranked lower by the corresponding method than the AD model. It is clear that major parts of the dots are located up the y = x lines in all the three graphs. These indicate that, the AD model can rank the real top 1% papers higher than other three methods.\n\nFigure 4 shows the cumulative distribution of the age of the top 1% papers ranked by diﬀerent methods. The cumulative distribution of the real top 1% papers ranked by date in the future time window exponentially decays with age. This indicates that the number of papers ranked in the real top 1% decays rapidly with age, and only a small number of those papers are old papers. The cumulative distribution of the AD model has a similar exponential distribution as the real result. The distribution of CiteRank, PageRank, rescaled PageRank methods have an obvious deviation from the real result, and many old papers are ranked as top 1% papers.\n\nTo better understand the age bias of diﬀerent methods, we analyzed the ranking diﬀerence of diﬀerent methods for the real top 1% papers with diﬀerent age. We set the ranking diﬀerence of a paper as ∆r = log(rp) − log(rf), where rf is the paper’s real ranking in the future and rp is the paper’s ranking by a prediction method. We take the logarithm of the rankings to avoid the inﬂuence of the lowly ranked papers while calculating the average result. ∆r = 0 indicates the predicted ranking is echo to the real ranking, and the prediction method has a perfect performance; ∆r > 0 indicates the prediction method underestimate the paper’s popularity. ∆r < 0 indicates the prediction method overrate the paper’s popularity. Figure 5 shows the average value of ∆r for the papers under diﬀerent age. This ﬁgure only considers the real top 1% papers in the future time window. Figure 5 shows that, PageRank, CiteRank, and rescaled PageRank\n\n8\n\n1 0.1 n o i t u b i r t s i d 0.01 e v i t a RS l u m PR u c CR 1E-3 AD real 1E-4 0 20 40 60 80 100",
            "section": "other",
            "section_idx": 4,
            "citations": []
        },
        {
            "text": "Acknowledgements\n\nWe are grateful to An Zeng for useful comments and suggestions. This work was supported in part by the National Nature Science Foundation of China under Grant 61603340 and 61773348, and in part by the National Nature Science Foundation of Zhejiang Province under Grant LY19F020023.\n\nReferences\n\nReferences\n\n[1] Fanelli D. Do Pressures to Publish Increase Scientists’ Bias? An Empirical Support from US States Data. PLOS ONE, 2010, 5(4): e10271.\n\n[2] Sarewitz D. The pressure to publish pushes down quality. Nature, 2016, 533(7602):147-147.\n\n[3] Zeng A, Shen Z, Zhou J, et al. The science of science: From the perspective of complex systems. Physics Reports, 2017, 714: 1-73.\n\n[4] Mingers J, Leydesdorﬀ L. A review of theory and practice in scientometrics. European journal of operational research, 2015, 246(1): 1-19.\n\n[5] Waltman L. A review of the literature on citation impact indicators. Journal of informetrics, 2016, 10(2): 365-391.\n\n[6] Hirsch J E. An index to quantify an individual’s scientiﬁc research output. Proceedings of the National academy of Sciences, 2005, 102(46): 16569-16572.\n\n[7] Garﬁeld E. The history and meaning of the journal impact factor. Jama, 2006, 295(1): 90-93.\n\n[8] Price D S. A general theory of bibliometric and other cumulative advantage processes. Journal of the American society for Information science, 1976, 27(5): 292-306.\n\n[9] Newman M E J. The ﬁrst-mover advantage in scientiﬁc publication. Europhysics Letters, 2009, 86(6): 68001.\n\n[10] Newman M E J. Prediction of highly cited papers. Europhysics Letters, 2014, 105(2): 28002.\n\n[11] Mariani M S, Medo M, Zhang Y C. Identiﬁcation of milestone papers through time-balanced network centrality. Journal of Informetrics, 2016, 10( 4):1207-1223.\n\n[12] Vaccario G, Medo M, Wider N, et al. Quantifying and suppressing ranking bias in a large citation network. Journal of Informetrics, 2017, 11( 3):766-782.\n\n[13] Caldarelli G, Capocci A, De Los Rios P, et al. Scale-free networks from varying vertex intrinsic ﬁtness. Physical review letters, 2002, 89(25): 258702.\n\n[14] Bianconi G, Barab´asi A L. Competition and multiscaling in evolving networks. Europhysics Letters, 2001, 54(4): 436.\n\n[15] Medo M, Cimini G, Gualdi S. Temporal eﬀects in the growth of networks. Physical review letters, 2011, 107(23): 238701.\n\n[16] Zhou Y, Cheng H, Li Q, Wang W. Diversity of temporal inﬂuence in popularity prediction of scientiﬁc publications, Scientometrics, 2020, 123(1): 383-392.\n\n[17] Parolo P D B, Pan R K, Ghosh R, et al. Attention decay in science. Journal of Informetrics, 2015, 9(4): 734-745.\n\n[18] Wang D, Song C, Barab´asi A L. Quantifying long-term scientiﬁc impact. Science, 2013, 342(6154): 127-132.\n\n[19] Zhou Y B , L¨u L, Li M. Quantifying the inﬂuence of scientists and their publications: distinguishing between prestige and popularity[J]. New Journal of Physics, 2011, 14(3):33033-33049(17).\n\n[20] Page L. The pagerank citation ranking: Bringing order to the web. Stanford InfoLab, 1999, 1-14.\n\n[21] Brin S, Page L. The anatomy of a large-scale hypertextual Web search engine. Computer Networks & Isdn Systems, 1998, 30.\n\n[22] Chen P, Xie H, Maslov S, Redner S. Finding scientiﬁc gems with Google’s PageRank algorithm. Journal of Informetrics, 2007, 1(1): 8-15.\n\n[23] Ma N, Guan J, Zhao Y. Bringing PageRank to the citation analysis. Information Processing & Management, 2008, 44(2): 800-810.\n\n11\n\n[24] Walker D, Xie H, Yan K K, Maslov S. Ranking scientiﬁc publications using a model of network traﬃc. Journal of Statistical Mechanics: Theory and Experiment, 2007, 2007(06):P06010-P06010.\n\n[25] Mariani M S, Medo M, Zhang Y C, Identiﬁcation of milestone papers through time-balanced network centrality, Journal of Informetrics, 2016,10(4), 1207-1223,\n\n[26] Kanellos I, Vergoulis T, Sacharidis D, et al. Impact-Based Ranking of Scientiﬁc Publications: A Survey and Experimental Evaluation. IEEE Transactions on Knowledge and Data Engineering, 2019: 1-1.\n\n12",
            "section": "other",
            "section_idx": 5,
            "citations": [
                "1",
                "2",
                "3",
                "4",
                "5",
                "6",
                "7",
                "8",
                "9",
                "10",
                "11",
                "12",
                "13",
                "14",
                "15",
                "16",
                "17",
                "18",
                "19",
                "20",
                "21",
                "22",
                "23",
                "24",
                "25",
                "26"
            ]
        }
    ],
    "figures": [
        {
            "path": "output\\images\\8021aa15-83af-423b-87ce-6548aeed6e58.jpg",
            "description": "The figure presents a cumulative distribution plot of different models compared to real data, illustrating how various algorithms or methodologies predict age distribution. The x-axis represents age in years, while the y-axis shows the cumulative distribution on a logarithmic scale. The legend indicates five different series: RS (blue circles), PR (green triangles), CR (red circles), AD (yellow squares), and real data (black diamonds). Each series likely represents a different model or approach used in the research, with the real data serving as a baseline for comparison. This figure is important as it visually communicates how closely each model aligns with actual data, highlighting the performance of the models in terms of predicting age distribution.",
            "importance": 9
        },
        {
            "path": "output\\images\\5988287f-778c-4696-9157-58e6bf892339.jpg",
            "description": "This figure illustrates the architecture of a convolutional neural network (CNN) designed for image analysis, specifically targeting breast cancer classification. The diagram includes several layers of the network, starting with input images of size 50x50 pixels. The architecture comprises multiple convolutional layers (Conv2D) with varying filter sizes, followed by max-pooling layers to downsample the feature maps. Each layer is labeled with its respective output size and number of filters, providing a clear view of the network's progression.\n\nAdditionally, the network includes dropout layers to prevent overfitting and dense layers leading to a softmax output for classification into benign or malignant categories. The activation functions used in the layers are specified, indicating the non-linear transformations applied at each step.\n\nThe figure is crucial for understanding the methodology of the research, as it details the core innovation in the network design, which is essential for reproducing the results and understanding the performance of the model in classifying breast cancer images.",
            "importance": 9
        },
        {
            "path": "output\\images\\0eb26194-bdb1-4103-bb1b-f4de7eab83da.jpg",
            "description": "The figure illustrates the architecture of a deep reinforcement learning model designed for playing Atari games, specifically focusing on the integration of a convolutional neural network (CNN) for feature extraction and a long short-term memory (LSTM) network for temporal sequence processing. The architecture diagram shows the flow of information from the input layer, consisting of raw pixel data from game frames, through several convolutional layers that capture spatial hierarchies. These are followed by LSTM units that handle temporal dependencies, crucial for understanding game dynamics over time. The final output layer represents the action space, predicting the optimal moves based on processed inputs.\n\nAdditionally, the figure includes a graph showing the model's performance, measured in terms of game score, across different training iterations. This visualization highlights the improvement in performance as training progresses, illustrating the effectiveness of the architecture.\n\nThe importance of this figure lies in its comprehensive depiction of both the model architecture and its performance, serving as a key visualization for understanding the methodology and results of the research.",
            "importance": 9
        },
        {
            "path": "output\\images\\dd10b88c-ca49-4296-b1ba-6022fdc8d508.jpg",
            "description": "This figure consists of three line charts showing the performance of four different methods (PR, CR, AD, RS) over a period of 10 years, indicated on the x-axis as \\( T_f \\). Each subplot represents a different metric:\n\n1. **Top Chart (Precision):** Displays the precision values for each method over time. The precision for each method is represented by different markers: triangles for PR, pentagons for CR, squares for AD, and circles for RS. The precision appears to increase slightly for some methods over time.\n\n2. **Middle Chart (p):** Illustrates another metric labeled \"p\" for each method over the same time frame. The performance trend is similar to the precision chart, with PR starting lower and CR, AD showing higher values.\n\n3. **Bottom Chart (r):** Represents the metric \"r\" for each method. Here, the methods maintain more consistent values over time, with AD achieving the highest values and PR the lowest.\n\nThe charts collectively compare the performance of the four methods across different metrics, highlighting trends and differences over the period studied. This figure is important for understanding the comparative effectiveness and stability of the methods over time, which is likely crucial to the paper's findings.",
            "importance": 8
        },
        {
            "path": "output\\images\\19d3d1d1-2979-47ac-9fe6-ce11ebfb8917.jpg",
            "description": "The figure consists of three scatter plots that compare different datasets or variables against a common variable labeled \"AD.\" Each plot uses a logarithmic scale on both axes, illustrating the relationships between:\n\n1. **Left Plot:** Compares \"CR\" on the y-axis with \"AD\" on the x-axis. The data points are densely clustered, showing a positive correlation, as indicated by their alignment along the diagonal line.\n\n2. **Middle Plot:** Compares \"PR\" on the y-axis with \"AD\" on the x-axis. The scatter pattern suggests a positive correlation, although the spread is wider compared to the first plot, indicating more variability.\n\n3. **Right Plot:** Compares \"RS\" on the y-axis with \"AD\" on the x-axis. Similar to the other plots, a positive correlation is evident, with a tighter clustering of points along the diagonal.\n\nThese plots likely illustrate the relationships or dependencies between \"AD\" and the other variables (\"CR,\" \"PR,\" \"RS\"), which may be key to understanding the methodology or results of the research. The presence of the diagonal line suggests a reference to a perfect correlation, used to visually assess the strength and nature of the relationships presented.",
            "importance": 7
        },
        {
            "path": "output\\images\\e77e8637-cd60-4e3f-b0f0-6d69c8460258.jpg",
            "description": "The figure consists of three contour plots labeled B, C, and an unlabeled one. Each plot displays a two-dimensional parameter space with axes labeled \\(\\alpha\\) (horizontal axis) and \\(\\tau\\) (vertical axis), ranging from 0.0 to 0.9 and 0 to 120 respectively. The contours represent different levels of a parameter or variable, depicted by a grayscale color bar on the right side of each plot. The grayscale indicates the magnitude of the variable, with darker shades representing lower values and lighter shades indicating higher values. \n\nThe contours likely illustrate how the variable changes with different combinations of \\(\\alpha\\) and \\(\\tau\\). The differences in the contour patterns across the three plots suggest they represent different scenarios or conditions being analyzed. This visualization is crucial for understanding the relationship between the parameters \\(\\alpha\\) and \\(\\tau\\) and their impact on the variable being measured, making it an important aspect of the study's methodology or findings.",
            "importance": 7
        },
        {
            "path": "output\\images\\3d355e15-5cd4-42a5-9a10-d92878ab61cf.jpg",
            "description": "This figure is a bar chart illustrating the detection rate of four different methods—labeled as AD, CR, RS, and PR—across various age groups. The x-axis represents age in years, segmented into intervals (e.g., around 30, 60, etc.), while the y-axis denotes the detection rate, ranging from 0.0 to 0.8. Each age group contains four bars, each corresponding to one method, differentiated by color: AD (red), CR (green), RS (blue), and PR (cyan). The chart provides a comparative analysis of the effectiveness of these methods in detecting a particular condition or feature across different ages. This visualization is important for understanding the performance and reliability of each method, making it crucial for interpreting the methodology or key results of the research.",
            "importance": 7
        },
        {
            "path": "output\\images\\538e3c4a-b3aa-4339-ae8c-5ec607314913.jpg",
            "description": "This figure presents a line graph depicting the relationship between age (years) and a variable denoted as Δr. Four different datasets or groups are represented: PR (green triangles), RS (blue circles), AD (yellow squares), and CR (red hexagons), as indicated by the legend. The x-axis represents age, ranging from 0 to 90 years, while the y-axis shows the Δr values, which range from -3 to 4. Each line represents how Δr changes with age for each group. The graph likely illustrates key trends or differences among the groups across different ages, making it important for understanding variations in the parameter Δr over time. This could be crucial for interpreting the study's findings regarding age-related effects in the context of the research.",
            "importance": 7
        }
    ],
    "metadata": {
        "key_themes": [
            "cold start",
            "Popularity prediction",
            "Bibliometric analysis",
            "Autoregressive and Deterministic model",
            "Diffusion",
            "Complex networks",
            "Temporal analysis",
            "Research methods"
        ],
        "methodology": [
            "Network centrality",
            "Correlation coefficient",
            "Scientific methodology",
            "stochastic process",
            "Precision",
            "linear extrapolation",
            "Age-based decay",
            "Matrix",
            "Preferential attachment"
        ],
        "domain": [
            "Citation prediction",
            "Physical sciences"
        ],
        "strengths": [
            "Enhanced predictive accuracy",
            "Temporal data collection",
            "Predictive bibliometric ranking",
            "Model generalization",
            "Attention diffusion simulation",
            "Exponential decay rate",
            "Correlation analysis"
        ],
        "limitations": [
            "Temporal bias",
            "monthly resolution",
            "Cold start issue",
            "Publication pressure",
            "Inconsistency in predictive modeling."
        ]
    },
    "content_chunks": [
        {
            "chunk_id": "2010.08157v1_chunk_0",
            "section": "results",
            "citations": []
        },
        {
            "chunk_id": "2010.08157v1_chunk_1",
            "section": "results",
            "citations": []
        },
        {
            "chunk_id": "2010.08157v1_chunk_2",
            "section": "results",
            "citations": []
        },
        {
            "chunk_id": "2010.08157v1_chunk_3",
            "section": "results",
            "citations": [
                "26"
            ]
        },
        {
            "chunk_id": "2010.08157v1_chunk_4",
            "section": "other",
            "citations": [
                "1",
                "2",
                "3",
                "4, 5",
                "6",
                "7",
                "8",
                "9",
                "10",
                "11",
                "12",
                "13, 14",
                "15",
                "16",
                "17",
                "18",
                "19",
                "20, 21",
                "22, 23",
                "15, 17",
                "24",
                "26"
            ]
        },
        {
            "chunk_id": "2010.08157v1_chunk_5",
            "section": "other",
            "citations": [
                "22, 23"
            ]
        },
        {
            "chunk_id": "2010.08157v1_chunk_6",
            "section": "other",
            "citations": [
                "24",
                "11"
            ]
        },
        {
            "chunk_id": "2010.08157v1_chunk_7",
            "section": "other",
            "citations": []
        },
        {
            "chunk_id": "2010.08157v1_chunk_8",
            "section": "other",
            "citations": []
        },
        {
            "chunk_id": "2010.08157v1_chunk_9",
            "section": "other",
            "citations": [
                "1",
                "2",
                "3",
                "4",
                "5",
                "6",
                "7",
                "8",
                "9",
                "10",
                "11",
                "12",
                "13",
                "14",
                "15",
                "16",
                "17",
                "18",
                "19",
                "20",
                "21",
                "22",
                "23",
                "24",
                "25",
                "26"
            ]
        }
    ]
}